; domain
(define (domain gripper-strips)

    (:predicates (room ?r)
                (ball ?b)
                (gripper ?g)
                (at-robby ?r)
                (at ?b ?r)
                (free ?g)
                (carry ?o ?g)
    )

    (:action move
        :parameters (?from ?to)
        :precondition (and (room ?from)(room ?to)(at-robby ?from))
        :effect (and
            (at-robby ?to)
            (not (at-robby ?from))
        )
    )
    (:action pick
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(at ?obj ?room)(at-robby ?room)(free ?gripper))
        :effect (and
            (carry ?obj ?gripper)
            (not (at ?obj ?room))
            (not (free ?gripper))
        )
    )
    (:action drop
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(carry ?obj ?gripper)(at-robby ?room))
        :effect (and
            (at ?obj ?room)
            (free ?gripper)
            (not (carry ?obj ?gripper))
        )
    )
)

; problem
(define (problem gripper-9)
(:domain gripper-strips)
(:objects rooma roomb room3 room4 room5 room6 left ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 )
(:init
(room rooma)
(room roomb)
(room room3)
(room room4)
(room room5)
(room room6)
(gripper left)
(ball ball1)
(ball ball2)
(ball ball3)
(ball ball4)
(ball ball5)
(ball ball6)
(ball ball7)
(ball ball8)
(ball ball9)
(free left)
(at ball1 rooma)
(at ball2 roomb)
(at ball3 roomb)
(at ball4 room3)
(at ball5 room4)
(at ball6 room4)
(at ball7 room5)
(at ball8 room5)
(at ball9 room6)
(at-robby rooma)
)
(:goal
(and
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 rooma)
(at ball5 rooma)
(at ball6 rooma)
(at ball7 rooma)
(at ball8 rooma)
(at ball9 rooma)
)
)
)

; plan
1. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 1 of 9
2. (pick ball3 roomb left)
   deleted: (at ball3 roomb) (free left)
   added: (carry ball3 left)
   goals met: 1 of 9
3. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 1 of 9
4. (drop ball3 rooma left)
   deleted: (carry ball3 left)
   added: (at ball3 rooma) (free left)
   goals met: 2 of 9
5. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 2 of 9
6. (pick ball2 roomb left)
   deleted: (at ball2 roomb) (free left)
   added: (carry ball2 left)
   goals met: 2 of 9
7. (move roomb room6)
   deleted: (at-robby roomb)
   added: (at-robby room6)
   goals met: 2 of 9
8. (move room6 rooma)
   deleted: (at-robby room6)
   added: (at-robby rooma)
   goals met: 2 of 9
9. (drop ball2 rooma left)
   deleted: (carry ball2 left)
   added: (at ball2 rooma) (free left)
   goals met: 3 of 9
10. (move rooma room6)
   deleted: (at-robby rooma)
   added: (at-robby room6)
   goals met: 3 of 9
11. (pick ball9 room6 left)
   deleted: (at ball9 room6) (free left)
   added: (carry ball9 left)
   goals met: 3 of 9
12. (move room6 room5)
   deleted: (at-robby room6)
   added: (at-robby room5)
   goals met: 3 of 9
13. (move room5 rooma)
   deleted: (at-robby room5)
   added: (at-robby rooma)
   goals met: 3 of 9
14. (drop ball9 rooma left)
   deleted: (carry ball9 left)
   added: (at ball9 rooma) (free left)
   goals met: 4 of 9
15. (move rooma room5)
   deleted: (at-robby rooma)
   added: (at-robby room5)
   goals met: 4 of 9
16. (pick ball8 room5 left)
   deleted: (at ball8 room5) (free left)
   added: (carry ball8 left)
   goals met: 4 of 9
17. (move room5 rooma)
   deleted: (at-robby room5)
   added: (at-robby rooma)
   goals met: 4 of 9
18. (drop ball8 rooma left)
   deleted: (carry ball8 left)
   added: (at ball8 rooma) (free left)
   goals met: 5 of 9
19. (move rooma room5)
   deleted: (at-robby rooma)
   added: (at-robby room5)
   goals met: 5 of 9
20. (pick ball7 room5 left)
   deleted: (at ball7 room5) (free left)
   added: (carry ball7 left)
   goals met: 5 of 9
21. (move room5 room4)
   deleted: (at-robby room5)
   added: (at-robby room4)
   goals met: 5 of 9
22. (move room4 rooma)
   deleted: (at-robby room4)
   added: (at-robby rooma)
   goals met: 5 of 9
23. (drop ball7 rooma left)
   deleted: (carry ball7 left)
   added: (at ball7 rooma) (free left)
   goals met: 6 of 9
24. (move rooma room4)
   deleted: (at-robby rooma)
   added: (at-robby room4)
   goals met: 6 of 9
25. (pick ball6 room4 left)
   deleted: (at ball6 room4) (free left)
   added: (carry ball6 left)
   goals met: 6 of 9
26. (move room4 rooma)
   deleted: (at-robby room4)
   added: (at-robby rooma)
   goals met: 6 of 9
27. (drop ball6 rooma left)
   deleted: (carry ball6 left)
   added: (at ball6 rooma) (free left)
   goals met: 7 of 9
28. (move rooma room4)
   deleted: (at-robby rooma)
   added: (at-robby room4)
   goals met: 7 of 9
29. (pick ball5 room4 left)
   deleted: (at ball5 room4) (free left)
   added: (carry ball5 left)
   goals met: 7 of 9
30. (move room4 room3)
   deleted: (at-robby room4)
   added: (at-robby room3)
   goals met: 7 of 9
31. (move room3 rooma)
   deleted: (at-robby room3)
   added: (at-robby rooma)
   goals met: 7 of 9
32. (drop ball5 rooma left)
   deleted: (carry ball5 left)
   added: (at ball5 rooma) (free left)
   goals met: 8 of 9
33. (move rooma room3)
   deleted: (at-robby rooma)
   added: (at-robby room3)
   goals met: 8 of 9
34. (pick ball4 room3 left)
   deleted: (at ball4 room3) (free left)
   added: (carry ball4 left)
   goals met: 8 of 9
35. (move room3 rooma)
   deleted: (at-robby room3)
   added: (at-robby rooma)
   goals met: 8 of 9
36. (drop ball4 rooma left)
   deleted: (carry ball4 left)
   added: (at ball4 rooma) (free left)
   goals met: 9 of 9
